_site/app/controllers/password_reset_controller.rb

SELECT  `users`.* FROM `users`  WHERE `users`.`email` = 'sethorama@bassplayer.st' LIMIT 1
---
	def create
		user = User.find_by(email: params[:email].downcase)