app/controllers/contacts_controller.rb

  def index
    @contacts = current_user.contacts.all
---
SELECT `contacts`.* FROM `contacts`  WHERE `contacts`.`user_id` = 1

  def show
    @contact = current_user.contacts.find(params[:id])
---
SELECT  `contacts`.* FROM `contacts`  WHERE `contacts`.`user_id` = 1 AND `contacts`.`id` = 1 LIMIT 1

  def create
    @contact = current_user.contacts.new(contact_params)

    respond_to do |format|
      if @contact.save
---
INSERT INTO `contacts` (`city`, `contact_email`, `created_at`, `first_name`, `last_name`, `phone_number`, `state`, `street`, `updated_at`, `user_id`, `zip_code`) VALUES ('Salem', 'sethorama@q.com', '2015-05-25 04:23:13', 'Seth', 'Reece', '5033026794', 'Oregon', '505 Fairview Ave SE Apt E', '2015-05-25 04:23:13', 1, '97302')