app/controllers/users_controller.rb

INSERT INTO `users` (`created_at`, `email`, `password_digest`, `updated_at`, `user_first_name`, `user_last_name`) VALUES ('2015-05-25 04:23:05', 'sethorama@q.com', '$2a$10$xk9q/iyoonhv/1aGa7LWrORKKo5mpyb/GKMhZwIxrOIQffHMoBecy', '2015-05-25 04:23:05', 'Seth', 'Reece')
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE `users` SET `password_digest` = '$2a$10$ZKca3/w5S5hBgRnB0rlidu.OAmRlrLKltOZbKMeyXdS2GXTb.nzSC', `updated_at` = '2015-05-26 18:18:38' WHERE `users`.`id` = 7
---
  def update
    respond_to do |format|
      if @user.update(user_params)